CaseLabGreenatom/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаказаПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Позиции</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

CaseLabGreenatom/src/Enums/СтатусЗаказаПоставщика/СтатусЗаказаПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаказаПоставщика</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>НаправленПоставщику</name>
  </enumValues>
  <enumValues>
    <name>Исполнен</name>
  </enumValues>
  <enumValues>
    <name>Просрочен</name>
  </enumValues>
  <enumValues>
    <name>ЗавтраПоставка</name>
  </enumValues>
  <enumValues>
    <name>СегодняПоставка</name>
  </enumValues>
</mdclass:Enum>

CaseLabGreenatom/src/Documents/ЗаказПоставщику/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ТекущийСотрудникСервер.СотрудникТекущегоПользователя();
	Адрес = "г.Москва, ул.Б.Ордынка, д.26";
	Статус = Перечисления.СтатусЗаказаПоставщика.Создан;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = "ЗП";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Статус = Перечисления.СтатусЗаказаПоставщика.Отменен;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуПозиции.Наименование КАК Наименование,
	|	ЗаказПоставщикуПозиции.Наименование.ОбъемУпаковки КАК ОбъемУпаковки,
	|	ЗаказПоставщикуПозиции.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ЗаказПоставщику.Позиции КАК ЗаказПоставщикуПозиции
	|ГДЕ
	|	ЗаказПоставщикуПозиции.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Для Каждого Строка Из Позиции Цикл
			
			Если Строка.Наименование <> ВыборкаДетальныеЗаписи.Наименование Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.ОбъемУпаковки = 0 Тогда
			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Заполните объем упаковки для позиции %1", ВыборкаДетальныеЗаписи.Наименование);
				Сообщение.Поле = "Объект.Позиции[ВыборкаДетальныеЗаписи.НомерСтроки].Наименование";
				Сообщение.Сообщить();
				
				Возврат;
							
			КонецЕсли;
						
			Если Строка.Количество < ВыборкаДетальныеЗаписи.ОбъемУпаковки Тогда
				
				Строка.Количество = ВыборкаДетальныеЗаписи.ОбъемУпаковки;
				Строка.Сумма = Строка.Количество * Строка.Цена;
				Строка.СуммаНДС = НДССервер.СуммаНДСПоСтавке(Строка.Сумма, Строка.СтавкаНДС);
				Строка.СуммаСНДС = Строка.Сумма + Строка.СуммаНДС;
				
				Сообщить(СтрШаблон("Для позиции %1 количество увеличено до целой упаковки.", ВыборкаДетальныеЗаписи.Наименование)); 
                			
			ИначеЕсли Строка.Количество > ВыборкаДетальныеЗаписи.ОбъемУпаковки Тогда
				
				КоличествоУпаковок = КоличествоУпаковокСервер.КоличествоУпаковок(Строка.Количество, ВыборкаДетальныеЗаписи.ОбъемУпаковки);
				
				Строка.Количество = КоличествоУпаковок * ВыборкаДетальныеЗаписи.ОбъемУпаковки;
				Строка.Сумма = Строка.Количество * Строка.Цена;
				Строка.СуммаНДС = НДССервер.СуммаНДСПоСтавке(Строка.Сумма, Строка.СтавкаНДС);
				Строка.СуммаСНДС = Строка.Сумма + Строка.СуммаНДС;
				
				Сообщить(СтрШаблон("Для позиции %1 количество увеличено до целой упаковки. ", ВыборкаДетальныеЗаписи.Наименование));
				
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЦикла;
	
	Статус = Перечисления.СтатусЗаказаПоставщика.НаправленПоставщику;

КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции


	
#КонецОбласти
